# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
first = pd.Series(np.random.randint(1, 5, size=100))
second = pd.Series(np.random.randint(1, 4, size=100))
third = pd.Series(np.random.randint(10000, 30001, size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.concat([first, second, third], axis=1)

df.head()

   0  1      2
0  2  2  29715
1  4  3  24896
2  4  2  18658
3  3  3  26418
4  2  1  15184

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.rename({0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, axis=1, inplace=True)

df.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            29715
1      4       3            24896
2      4       2            18658
3      3       3            26418
4      2       1            15184

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
bigcolumn = pd.DataFrame(pd.concat([first, second, third], axis=0))

bigcolumn

        0
0       2
1       4
2       4
3       3
4       2
..    ...
95  29453
96  26123
97  23006
98  29023
99  11232

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [6]:
bigcolumn.reset_index(inplace=True)

bigcolumn

     index      0
0        0      2
1        1      4
2        2      4
3        3      3
4        4      2
..     ...    ...
295     95  29453
296     96  26123
297     97  23006
298     98  29023
299     99  11232

[300 rows x 2 columns]